/* automatically generated by rust-bindgen 0.69.5 */

pub const __llvm__: u32 = 1;
pub const __clang__: u32 = 1;
pub const __clang_major__: u32 = 16;
pub const __clang_minor__: u32 = 0;
pub const __clang_patchlevel__: u32 = 0;
pub const __clang_version__: &[u8; 27] = b"16.0.0 (clang-1600.0.26.6)\0";
pub const __GNUC__: u32 = 4;
pub const __GNUC_MINOR__: u32 = 2;
pub const __GNUC_PATCHLEVEL__: u32 = 1;
pub const __GXX_ABI_VERSION: u32 = 1002;
pub const __ATOMIC_RELAXED: u32 = 0;
pub const __ATOMIC_CONSUME: u32 = 1;
pub const __ATOMIC_ACQUIRE: u32 = 2;
pub const __ATOMIC_RELEASE: u32 = 3;
pub const __ATOMIC_ACQ_REL: u32 = 4;
pub const __ATOMIC_SEQ_CST: u32 = 5;
pub const __OPENCL_MEMORY_SCOPE_WORK_ITEM: u32 = 0;
pub const __OPENCL_MEMORY_SCOPE_WORK_GROUP: u32 = 1;
pub const __OPENCL_MEMORY_SCOPE_DEVICE: u32 = 2;
pub const __OPENCL_MEMORY_SCOPE_ALL_SVM_DEVICES: u32 = 3;
pub const __OPENCL_MEMORY_SCOPE_SUB_GROUP: u32 = 4;
pub const __FPCLASS_SNAN: u32 = 1;
pub const __FPCLASS_QNAN: u32 = 2;
pub const __FPCLASS_NEGINF: u32 = 4;
pub const __FPCLASS_NEGNORMAL: u32 = 8;
pub const __FPCLASS_NEGSUBNORMAL: u32 = 16;
pub const __FPCLASS_NEGZERO: u32 = 32;
pub const __FPCLASS_POSZERO: u32 = 64;
pub const __FPCLASS_POSSUBNORMAL: u32 = 128;
pub const __FPCLASS_POSNORMAL: u32 = 256;
pub const __FPCLASS_POSINF: u32 = 512;
pub const __PRAGMA_REDEFINE_EXTNAME: u32 = 1;
pub const __VERSION__: &[u8; 38] = b"Apple LLVM 16.0.0 (clang-1600.0.26.6)\0";
pub const __OBJC_BOOL_IS_BOOL: u32 = 1;

pub const MPI_INFO_KEY_SESSION_PSET_SIZE: &[u8; 9] = b"mpi_size\0";
pub type wchar_t = ::std::os::raw::c_int;
pub type max_align_t = f64;
pub type MPI_Aint = isize;
pub type MPI_Offset = ::std::os::raw::c_longlong;
pub type MPI_Count = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_communicator_t {
    _unused: [u8; 0],
}
pub type MPI_Comm = *mut ompi_communicator_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_datatype_t {
    _unused: [u8; 0],
}
pub type MPI_Datatype = *mut ompi_datatype_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_errhandler_t {
    _unused: [u8; 0],
}
pub type MPI_Errhandler = *mut ompi_errhandler_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_file_t {
    _unused: [u8; 0],
}
pub type MPI_File = *mut ompi_file_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_group_t {
    _unused: [u8; 0],
}
pub type MPI_Group = *mut ompi_group_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_info_t {
    _unused: [u8; 0],
}
pub type MPI_Info = *mut ompi_info_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_op_t {
    _unused: [u8; 0],
}
pub type MPI_Op = *mut ompi_op_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_request_t {
    _unused: [u8; 0],
}
pub type MPI_Request = *mut ompi_request_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_message_t {
    _unused: [u8; 0],
}
pub type MPI_Message = *mut ompi_message_t;
pub type MPI_Status = ompi_status_public_t;
pub type MPI_F08_status = ompi_f08_status_public_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_win_t {
    _unused: [u8; 0],
}
pub type MPI_Win = *mut ompi_win_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mca_base_var_enum_t {
    _unused: [u8; 0],
}
pub type MPI_T_enum = *mut mca_base_var_enum_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_mpit_cvar_handle_t {
    _unused: [u8; 0],
}
pub type MPI_T_cvar_handle = *mut ompi_mpit_cvar_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mca_base_pvar_handle_t {
    _unused: [u8; 0],
}
pub type MPI_T_pvar_handle = *mut mca_base_pvar_handle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mca_base_pvar_session_t {
    _unused: [u8; 0],
}
pub type MPI_T_pvar_session = *mut mca_base_pvar_session_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_instance_t {
    _unused: [u8; 0],
}
pub type MPI_Session = *mut ompi_instance_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_status_public_t {
    pub MPI_SOURCE: ::std::os::raw::c_int,
    pub MPI_TAG: ::std::os::raw::c_int,
    pub MPI_ERROR: ::std::os::raw::c_int,
    pub _cancelled: ::std::os::raw::c_int,
    pub _ucount: usize,
}
#[test]
fn bindgen_test_layout_ompi_status_public_t() {
    const UNINIT: ::std::mem::MaybeUninit<ompi_status_public_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ompi_status_public_t>(),
        24usize,
        concat!("Size of: ", stringify!(ompi_status_public_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ompi_status_public_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ompi_status_public_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_SOURCE) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(MPI_SOURCE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_TAG) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(MPI_TAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_ERROR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(MPI_ERROR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cancelled) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(_cancelled)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._ucount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_status_public_t),
            "::",
            stringify!(_ucount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ompi_f08_status_public_t {
    pub MPI_SOURCE: ::std::os::raw::c_int,
    pub MPI_TAG: ::std::os::raw::c_int,
    pub MPI_ERROR: ::std::os::raw::c_int,
    pub internal: [::std::os::raw::c_int; 3usize],
}
#[test]
fn bindgen_test_layout_ompi_f08_status_public_t() {
    const UNINIT: ::std::mem::MaybeUninit<ompi_f08_status_public_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ompi_f08_status_public_t>(),
        24usize,
        concat!("Size of: ", stringify!(ompi_f08_status_public_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ompi_f08_status_public_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ompi_f08_status_public_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_SOURCE) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_f08_status_public_t),
            "::",
            stringify!(MPI_SOURCE)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_TAG) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_f08_status_public_t),
            "::",
            stringify!(MPI_TAG)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MPI_ERROR) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_f08_status_public_t),
            "::",
            stringify!(MPI_ERROR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).internal) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ompi_f08_status_public_t),
            "::",
            stringify!(internal)
        )
    );
}
pub type MPI_Datarep_extent_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: MPI_Datatype,
        arg2: *mut MPI_Aint,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Datarep_conversion_function = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: MPI_Datatype,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_void,
        arg5: MPI_Offset,
        arg6: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type MPI_Comm_errhandler_function = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut MPI_Comm, arg2: *mut ::std::os::raw::c_int, ...),
>;
pub type MPI_Session_errhandler_function = ::std::option::Option<
